УТ_для_edt.РасширениеСмарт/src/Catalogs/СегментыНоменклатуры/СегментыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СегментыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="405c5588-cdfb-4f5a-9865-24d3bcfeef95">
    <name>ДатаОчистки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4093595e-d27d-465f-b0ca-f342083be87a">
    <name>СпособФормирования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2f84f259-e895-4d2e-9ac2-2589be363272">
    <name>ДатаСоздания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cb8733d5-7388-4cae-95ad-076bde370072">
    <name>Описание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="99fcf2c5-6621-4706-9314-a0beade61fac">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="e82db532-b173-44ba-81ed-95d94feff0bb">
    <name>ФильтрыБитрикс</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="89ed0ae1-f973-4fe4-93f8-1b1ead9c0168">
      <name>Фильтр</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/InformationRegisters/СмартЗначенияСвойствФильтров/СмартЗначенияСвойствФильтров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="0bebf729-4f43-478b-8ab1-43d75d9251dd">
  <name>СмартЗначенияСвойствФильтров</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="943bb502-7f90-467e-90ac-29999aa289af">
    <name>Значение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="6c8b9f00-dc55-4e15-945a-e33d72cdf029">
    <name>НаборСвойств</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="508e263c-31e0-4863-a4a7-f006db9ee874">
    <name>ВидСвойств</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="9ec3be25-6356-4861-b4ec-7497781e8605">
    <name>Сегмент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.РасширениеСмарт/src/InformationRegisters/НоменклатураСегмента/НоменклатураСегмента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>НоменклатураСегмента</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Сегмент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.РасширениеСмарт/src/Enums/СпособыФормированияСегментов/СпособыФормированияСегментов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СпособыФормированияСегментов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ФормироватьВручную</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПериодическиОбновлять</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Catalogs/СегментыНоменклатуры/Forms/ФормаЭлемента/Module.bsl
//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 08.08.2021 18:38:13 задача 552
&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ГруппаПеренос = Элементы.Добавить("смартГруппаПеренос", Тип("ГруппаФормы"),Элементы.СтраницаФильтрыБитрикс);
	ГруппаПеренос.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПеренос.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	Элемент = Элементы.Добавить("смартСегментПереноса", Тип("ПолеФормы"),ГруппаПеренос);//Элементы.СтраницаФильтрыБитрикс
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	Элемент.Заголовок="Сегмент из которого переносить";
	Элемент.МаксимальнаяШирина=30;
	Элемент.АвтоМаксимальнаяШирина=Ложь;
	Элемент.ПутьКДанным = "Объект.смартСегментПереноса";
		
	КомандаПеренестиФильтр= Команды.Добавить("ПереносФильтра");
	КомандаПеренестиФильтр.Действие = "смарт_ПереносФильтра";
	КомандаПеренестиФильтр.Заголовок = "Перенести фильтр";
	КомандаПеренестиФильтр.Подсказка = "Перенос фильтра в другой сегмент";
	
	Кнопка = Элементы.Добавить("ПереносФильтра", Тип("КнопкаФормы"),ГруппаПеренос);//Элементы.СтраницаФильтрыБитрикс
	Кнопка.Заголовок = "Перенести значения свойств";
	Кнопка.ИмяКоманды = "ПереносФильтра";

	//Кнопка удаления записей по сегменту
	КомандаУдалитьЗначения= Команды.Добавить("смарт_УдалитьНоменклатуруСегмента");
	КомандаУдалитьЗначения.Действие = "смарт_УдалитьНоменклатуруСегмента";
	КомандаУдалитьЗначения.Заголовок = "УдалитьНоменклатуруСегмента";
	КомандаУдалитьЗначения.Подсказка = "УдалитьНоменклатуруСегмента";
	
	Кнопка = Элементы.Добавить("смарт_УдалитьНоменклатуруСегмента", Тип("КнопкаФормы"),Элементы.КомандыФильтра);//Элементы.СтраницаФильтрыБитрикс
	Кнопка.Заголовок = "Удалить номенклатуру сегмента";
	Кнопка.ИмяКоманды = "смарт_УдалитьНоменклатуруСегмента";
	
    //++#1311 смарт: Лопато 15.02.2023 //Изменить форму Счета на оплату (Счет-оферта)  
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартГруппаДополнительно", Тип("ГруппаФормы"), ЭтаФорма.Элементы.ГруппаОтветственный);
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Заголовок = "Дополнительно";
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НовыйЭлемент.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Одинарный;
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("смартИдентификаторДляФормул", Тип("ПолеФормы"), ЭтаФорма.Элементы.смартГруппаДополнительно);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартИдентификаторДляФормул";
	НовыйЭлемент.ТолькоПросмотр = НЕ Объект.Ссылка.Пустая();
	
	смартСервер.смартДобавитьКнопкуИнформацииНаФорму("смартИдентификаторДляФормул", "поле ""Идентификатор для формул""", 
													 ЭтаФорма.Элементы.смартГруппаДополнительно, ЭтаФорма);
    //--#1311 смарт: Лопато 15.02.2023
	
	//++ #Б-1436 смарт: Фролов 29.11.2024 //План продаж по сегментам. Доработка справочников и документов.
	НовыйЭлемент = Элементы.Добавить("смартРодитель", Тип("ПолеФормы"), Элементы.ГруппаШапка);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Родитель";
	НовыйЭлемент.Заголовок = "Группа";
	
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "смартРодительПриИзменении");				
	//-- #Б-1436 смарт: Фролов 29.11.2024
	
	//++ #Б-1704 смарт: Фролов 18.12.2024 //План продаж по сегментам. Дополнение. Доработать сегменты и документ План продаж
	НоваяГруппа = Этаформа.Элементы.Вставить("смартРозничкаяЦенаДляПланирования", Тип("ГруппаФормы"), ЭтаФорма.Элементы.ГруппаОтветственный);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.Заголовок = "Розничная цена для плана продаж";
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	НовыйЭлемент = Элементы.Добавить("смартТоварСегмента", Тип("ПолеФормы"), Элементы.смартРозничкаяЦенаДляПланирования);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартТоварСегмента";
	НовыйЭлемент.Заголовок = "Товар сегмента (смарт)";
	НовыйЭлемент.УстановитьДействие("НачалоВыбора", "смартРозничкаяЦенаДляПланированияНачалоВыбора");
	НовыйЭлемент.КнопкаВыпадающегоСписка = Ложь;

	НовыйЭлемент = Элементы.Добавить("смартВидЦены", Тип("ПолеФормы"), Элементы.смартРозничкаяЦенаДляПланирования);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартВидЦены";
	НовыйЭлемент.Заголовок = "Вид цены (смарт)";
	НовыйЭлемент.УстановитьДействие("НачалоВыбора", "смартРозничкаяЦенаДляПланированияНачалоВыбора");
	//-- #Б-1704 смарт: Фролов 18.12.2024
	
КонецПроцедуры

//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 09.08.2021 19:07:54 задача 552
&НаКлиенте
Процедура смарт_ПереносФильтра()
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Предварительно необходимо записать сегмент!");
		Возврат;
	КонецЕсли;
	
	МассивЭлементов=ЭлементыСегмента(Объект.Ссылка);
	
	ТекСтрока=Элементы.ФильтрыБитрикс.ТекущиеДанные;
	
	Если ТекСтрока=Неопределено Тогда
		Сообщить("Нет активного фильтра в ТЧ!");
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.смартСегментПереноса) Тогда
		Отбор = Новый Структура("ВидСвойств, НаборСвойств, Сегмент", ТекСтрока.Фильтр,МассивЭлементов,Объект.смартСегментПереноса);    
	Иначе	
		Отбор = Новый Структура("ВидСвойств, НаборСвойств", ТекСтрока.Фильтр,МассивЭлементов);    
	КонецЕсли; 
	
	ОткрытьФорму("РегистрСведений.СмартЗначенияСвойствФильтров.ФормаСписка", Новый Структура("Отбор, РежимВыбора", Отбор,Истина),ЭтаФорма,,,,Новый ОписаниеОповещения("смартПослеЗакрытияФормы",ЭтаФорма),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 10.09.2021 15:06:29
&НаКлиенте
Процедура смарт_УдалитьНоменклатуруСегмента()
	
	Оповещение = Новый ОписаниеОповещения("смартУдалениеСегмента",ЭтотОбъект); 
	ПоказатьВопрос(Оповещение, "Внимание!!! Будет удалена вся Номенклатура, по текущему сегменту, в регистре Номенклатура сегмента!",  // вместо привычного "Вопрос", теперь "ПоказатьВопрос"
	РежимДиалогаВопрос.ДаНет,
	0,  // задержка (секунды). необязательно
	КодВозвратаДиалога.Да, // задает кнопку по умолчанию. необязательно
	"Удаление значений" // устанавливаем заголовок. необязательно
	);
	
КонецПроцедуры

//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 10.09.2021 15:12:06
&НаКлиенте
Процедура смартУдалениеСегмента(Результат, Параметры) Экспорт // здесь, думаю, комментировать нечего
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		УдалитьНоменклатуруСегмента();
	КонецЕсли;
	
КонецПроцедуры

//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 10.09.2021 15:13:31
Процедура УдалитьНоменклатуруСегмента()
	НаборЗаписей = РегистрыСведений.НоменклатураСегмента.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Сегмент.Установить(Объект.Ссылка);
	НаборЗаписей.Записать();   
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭлементыСегмента(СсылкаНаСегмент)
	  Возврат СегментыСервер.МассивЭлементов(СсылкаНаСегмент);
КонецФункции

//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 09.08.2021 19:07:54 задача 552
&НаКлиенте
Процедура смартПослеЗакрытияФормы(ПараметрЗакрытия, ДополнительныеПараметры) Экспорт 
	Если ПараметрЗакрытия<>Неопределено И ПараметрЗакрытия.Количество()>0 Тогда
		 смартПереносСементаРегистра(ПараметрЗакрытия);
	КонецЕсли; 
КонецПроцедуры

//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 09.08.2021 19:07:54 задача 552
&НаСервере
Процедура смартПереносСементаРегистра(ПараметрЗакрытия)
	
	 СтрНом="";
	 Для каждого Стр Из ПараметрЗакрытия Цикл
		СтрНом=СтрНом+Стр.НаборСвойств+";";

		НаборДанных=РегистрыСведений.СмартЗначенияСвойствФильтров.СоздатьНаборЗаписей();
		НаборДанных.Отбор.ВидСвойств.Установить(Стр.ВидСвойств);
		НаборДанных.Отбор.Сегмент.Установить(Стр.Сегмент);
		НаборДанных.Отбор.НаборСвойств.Установить(Стр.НаборСвойств);
		НаборДанных.Прочитать(); 
		ТЗнабора=НаборДанных.Выгрузить();
		НаборДанных.Очистить();
		НаборДанных.Записать();
		Если ТЗнабора.Количество()>0 Тогда
			Для каждого СтрокаПредЗапись Из ТЗнабора Цикл
				СтрокаПредЗапись.Сегмент=Объект.Ссылка;
			КонецЦикла; 
			НаборДанных2=РегистрыСведений.СмартЗначенияСвойствФильтров.СоздатьНаборЗаписей();
			НаборДанных2.Отбор.ВидСвойств.Установить(Стр.ВидСвойств);
			НаборДанных2.Отбор.Сегмент.Установить(Объект.Ссылка);
			НаборДанных2.Отбор.НаборСвойств.Установить(Стр.НаборСвойств);
			НаборДанных2.Загрузить(ТЗнабора);
			НаборДанных2.Записать();
		КонецЕсли;
	КонецЦикла; 
	
	ОбщегоНазначения.СообщитьПользователю("Перенос фильтров завершен!"+Символы.ПС+" "+СтрНом);
	Объект.смартСегментПереноса=Справочники.СегментыНоменклатуры.ПустаяСсылка();
	
КонецПроцедуры

//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 09.08.2021 19:07:54 задача 552
&НаКлиенте
Процедура смарт_ФильтрыБитриксПередУдалениемПосле(Элемент, Отказ)
	
	ТекущаяСтрока=Элементы.ФильтрыБитрикс.ТекущиеДанные;
	Отказ=ПроверитьВозможностьУдаления(ТекущаяСтрока.Фильтр,Объект.Ссылка);
	Если Отказ Тогда
		Сообщить("Внимание! Есть заполенные значения фильтров, удалить не возможно!");
	КонецЕсли; 
	
КонецПроцедуры

//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 09.08.2021 19:07:54 задача 552
&НаСервереБезКонтекста
Функция ПроверитьВозможностьУдаления(Фильтр,Сегмент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СмартЗначенияСвойствФильтров.НаборСвойств КАК НаборСвойств,
		|	СмартЗначенияСвойствФильтров.ВидСвойств КАК ВидСвойств,
		|	СмартЗначенияСвойствФильтров.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.СмартЗначенияСвойствФильтров КАК СмартЗначенияСвойствФильтров
		|ГДЕ
		|	СмартЗначенияСвойствФильтров.ВидСвойств = &Фильтр
		|	И СмартЗначенияСвойствФильтров.Сегмент = &Сегмент";
	
	Запрос.УстановитьПараметр("Фильтр", Фильтр);
	Запрос.УстановитьПараметр("Сегмент",Сегмент);
	
	РезультатЗапроса = Запрос.Выполнить();

	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

//&НаСервере
//Процедура смарт_ФильтрыБитриксПриИзмененииПослеНаСервере(Фильтр)
//	// Вставить содержимое обработчика.
//КонецПроцедуры

//&НаКлиенте
//Процедура смарт_ФильтрыБитриксПриИзмененииПосле(Элемент)
//	ТекСтрока=Элементы.ФильтрыБитрикс.ТекущиеДанные;
//	смарт_ФильтрыБитриксПриИзмененииПослеНаСервере(ТекСтрока.Фильтр);
//КонецПроцедуры

//++#1311 смарт: Лопато 15.02.2023 //Изменить форму Счета на оплату (Счет-оферта)  
&НаКлиенте
Процедура смартДействиеПоказатьИнформацию(Команда)
	
	Если СтрНайти(Команда.Имя, "смартИдентификаторДляФормул") <> 0 Тогда

		ИнформацияЗаголовок = "Идентификатор для формул";

		ИнформацияТекст = СтроковыеФункцииКлиент.ФорматированнаяСтрока(
			  НСтр("ru = 'В поле <b>Идентификатор для формул</b> указывается имя сегмента для использования в программном коде.'")
			+ Символы.ПС
			+ Символы.ПС
			+ НСтр("ru = '<b>Изменять не рекомендуется!'")
			+ Символы.ПС
			+ НСтр("ru = '<b>Перед изменением идентификтатора необходимо убедиться, что он не используется!</b>'")
			);

	Иначе
		ИнформацияЗаголовок = "";
		ИнформацияТекст = "";	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИнформацияЗаголовок) И ЗначениеЗаполнено(ИнформацияТекст) Тогда
		ОткрытьФорму("ОбщаяФорма.смартФормаИнформацияПоДоработкам", Новый Структура("Заголовок, Информация", ИнформацияЗаголовок, ИнформацияТекст), ЭтаФорма);
	КонецЕсли;

КонецПроцедуры //--#1311 смарт: Лопато 15.02.2023

&НаСервере
//++ #Б-1436 смарт: Фролов 28.11.2024 //План продаж по сегментам. Доработка справочников и документов.
Функция смартПроверитьПересечениеСДругимиСегментами(МассивНоменклатуры)

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Сегмент КАК Сегмент,
	|	Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрСведений.НоменклатураСегмента
	|ГДЕ
	|	Номенклатура В(&МассивНоменклатуры)
	|	И Сегмент.смартИспользуетсяВПланированииПродаж
	|	И Сегмент <> &ЭтотСегмент");
	Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);
	Запрос.УстановитьПараметр("ЭтотСегмент", Объект.Ссылка);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		
		Возврат Ложь;
		
	Иначе
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ОбщегоНазначения.СообщитьПользователю("Номенклатура " + Выборка.Номенклатура + " уже присутствует в сегменте " + 
			Выборка.Сегмент + ", запись не возможна");	
		КонецЦикла;	
		
		Возврат Истина;
		
	КонецЕсли;	
	
КонецФункции //-- #Б-1436 смарт: Фролов 28.11.2024	

&НаСервере
//++ #Б-1436 смарт: Фролов 28.11.2024 //План продаж по сегментам. Доработка справочников и документов.
Функция смартПолучитьМассивНоменклатурыСКД(СКД, Настройки)

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(
		СКД, Настройки, , ,
		Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , , Истина);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТаблицаЗначений = Новый ТаблицаЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаЗначений);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

	ТаблицаЗначений.Свернуть("Номенклатура");

	Возврат ТаблицаЗначений.ВыгрузитьКолонку("Номенклатура");

КонецФункции //-- #Б-1436 смарт: Фролов 28.11.2024

&НаКлиенте
//++ #Б-1436 смарт: Фролов 29.11.2024 //План продаж по сегментам. Доработка справочников и документов.
Процедура смартРодительПриИзменении(Элемент)
	
	Если Объект.смартИспользуетсяВПланированииПродаж Тогда
		
		Если ЗначениеЗаполнено(Объект.Родитель) 
			И НЕ CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(Объект.Родитель, "смартИспользуетсяВПланированииПродаж") Тогда
			
			ОбщегоНазначенияКлиент.СообщитьПользователю("Группа " + Объект.Родитель + " не используется в планировании!");
			Объект.Родитель = Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;
	
	//++ #Б-2220 смарт: Фролов 28.02.2025 //План продаж и План-фактный анализ (доработка новых потребностей)
	Если Объект.смартИспользуетсяКакТипНоменклатуры Тогда
		
		Если ЗначениеЗаполнено(Объект.Родитель) 
			И НЕ CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(Объект.Родитель, "смартИспользуетсяКакТипНоменклатуры") Тогда
			
			ОбщегоНазначенияКлиент.СообщитьПользователю("Группа " + Объект.Родитель + " не используется как тип номенклатуры!");
			Объект.Родитель = Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;
	//-- #Б-2220 смарт: Фролов 28.02.2025
	
КонецПроцедуры //-- #Б-1436 смарт: Фролов 29.11.2024

&НаКлиенте
&ИзменениеИКонтроль("ПриОткрытии")
//++ #Б-1436 смарт: Фролов 29.11.2024 //План продаж по сегментам. Доработка справочников и документов.
Процедура смарт_ПриОткрытии(Отказ)

	УправлениеДоступностью();

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	#Вставка
	//++ #Б-1436 смарт: Фролов 29.11.2024 //План продаж по сегментам. Доработка справочников и документов.
	НужноОткрытьФормуДляПланирования = Ложь;
	//++ #Б-2220 смарт: Фролов 07.03.2025 //План продаж и План-фактный анализ (доработка новых потребностей)
	НужноОткрытьФормуДляТиповНоменклатуры = Ложь;
	//-- #Б-2220 смарт: Фролов 07.03.2025
	
	Если Объект.смартИспользуетсяВПланированииПродаж Тогда
		
		НужноОткрытьФормуДляПланирования = Истина;
		
	КонецЕсли;
	
	//++ #Б-2220 смарт: Фролов 28.02.2025 //План продаж и План-фактный анализ (доработка новых потребностей)
	Если Объект.смартИспользуетсяКакТипНоменклатуры Тогда	
		
		НужноОткрытьФормуДляТиповНоменклатуры = Истина;
		
	КонецЕсли;
	//-- #Б-2220 смарт: Фролов 28.02.2025

	
	Если ЭтаФорма.ПараметрыВыбора.Свойство("смартИспользуетсяВПланированииПродаж") 
			И ЭтаФорма.ПараметрыВыбора.смартИспользуетсяВПланированииПродаж Тогда
			
		НужноОткрытьФормуДляПланирования = Истина;
		
	//++ #Б-2220 смарт: Фролов 07.03.2025 //План продаж и План-фактный анализ (доработка новых потребностей)
	Иначе 
		
		НужноОткрытьФормуДляПланирования = Ложь;
	//-- #Б-2220 смарт: Фролов 07.03.2025		
	КонецЕсли;
	
	//++ #Б-2220 смарт: Фролов 28.02.2025 //План продаж и План-фактный анализ (доработка новых потребностей)
	Если (ЭтаФорма.ПараметрыВыбора.Свойство("смартИспользуетсяКакТипНоменклатуры") 
			И ЭтаФорма.ПараметрыВыбора.смартИспользуетсяКакТипНоменклатуры) Тогда
			
		НужноОткрытьФормуДляТиповНоменклатуры = Истина;
		
	Иначе
		
		НужноОткрытьФормуДляТиповНоменклатуры = Ложь;
		
	КонецЕсли;
	
	Попытка
		Если ЭтаФорма.ВладелецФормы.Родитель.ИмяФормы = "Справочник.СегментыНоменклатуры.Форма.смартФормаСпискаПланирование" 
			ИЛИ (ЭтаФорма.ВладелецФормы.Родитель.ИмяФормы = "Справочник.СегментыНоменклатуры.Форма.ФормаВыбора" 
			И Объект.смартИспользуетсяВПланированииПродаж) Тогда
			
			НужноОткрытьФормуДляПланирования = Истина;
			
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Попытка
		Если ЭтаФорма.ВладелецФормы.Родитель.ИмяФормы = "Справочник.СегментыНоменклатуры.Форма.смартФормаСпискаДляТиповНоменклатуры"
			ИЛИ (ЭтаФорма.ВладелецФормы.Родитель.ИмяФормы = "Справочник.СегментыНоменклатуры.Форма.ФормаВыбора" 
			И Объект.смартИспользуетсяКакТипНоменклатуры) Тогда
			
			НужноОткрытьФормуДляТиповНоменклатуры = Истина;
			
		КонецЕсли;
	Исключение
	КонецПопытки;	
	//-- #Б-2220 смарт: Фролов 28.02.2025		
		
	Если НужноОткрытьФормуДляПланирования ИЛИ НужноОткрытьФормуДляТиповНоменклатуры Тогда
		
		Если Объект.Ссылка.Пустая() Тогда
			
			Если НЕ ЗначениеЗаполнено(Объект.Родитель) Тогда
				
				ОбщегоНазначенияКлиент.СообщитьПользователю("Сегмент для планирования может быть создан только в соответствующей группе!");
				Отказ = Истина;
				Возврат;
				
			ИначеЕсли НужноОткрытьФормуДляПланирования И НЕ CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(Объект.Родитель, "смартИспользуетсяВПланированииПродаж") Тогда
				
				ОбщегоНазначенияКлиент.СообщитьПользователю("Группа " + Объект.Родитель + " не используется в планировании!");
				Отказ = Истина;
				Возврат;
				
			//++ #Б-2220 смарт: Фролов 28.02.2025 //План продаж и План-фактный анализ (доработка новых потребностей)	
			ИначеЕсли НужноОткрытьФормуДляТиповНоменклатуры И НЕ CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(Объект.Родитель, "смартИспользуетсяКакТипНоменклатуры") Тогда
				
				ОбщегоНазначенияКлиент.СообщитьПользователю("Группа " + Объект.Родитель + " не используется для типов номенклатуры!");
				Отказ = Истина;
				Возврат;
			//-- #Б-2220 смарт: Фролов 28.02.2025
			
			КонецЕсли;	
			
			ДниНедели = Новый Массив;
			ДниНедели.Добавить(1);
			ДниНедели.Добавить(2);
			ДниНедели.Добавить(3);
			ДниНедели.Добавить(4);
			ДниНедели.Добавить(5);
			
			НовоеРасписание = Новый РасписаниеРегламентногоЗадания;
			НовоеРасписание.ДатаНачала = ТекущаяДата();
			НовоеРасписание.ПериодНедель = 1;
			НовоеРасписание.ПериодПовтораВТечениеДня = 3600;
			НовоеРасписание.ПериодПовтораДней = 1;
			НовоеРасписание.ДниНедели = ДниНедели;
			НовоеРасписание.ВремяНачала	= Дата("000101010800"); 
			НовоеРасписание.ВремяКонца	= Дата("000101011800");
			
			Расписание = НовоеРасписание;
			
			РасписаниеСтрокой = Строка(Расписание);
			
			РегламентноеЗаданиеИспользуется = Истина;
			
			//++ #Б-2220 смарт: Фролов 28.02.2025 //План продаж и План-фактный анализ (доработка новых потребностей)
			Если НужноОткрытьФормуДляПланирования Тогда
				Объект.смартИспользуетсяВПланированииПродаж = Истина;	
			ИначеЕсли НужноОткрытьФормуДляТиповНоменклатуры Тогда
				Объект.смартИспользуетсяКакТипНоменклатуры = Истина;
				Элементы.смартРозничкаяЦенаДляПланирования.Видимость = Ложь;
			КонецЕсли;	
			//Объект.смартИспользуетсяВПланированииПродаж = Истина;
			//-- #Б-2220 смарт: Фролов 28.02.2025
			
			Объект.СпособФормирования = ПредопределенноеЗначение("Перечисление.СпособыФормированияСегментов.ПериодическиОбновлять");
			
		КонецЕсли;
		
		Элементы.СтраницыФормы.Видимость = Ложь;
		Элементы.СпособФормирования.Видимость = Ложь;
		Элементы.ГруппаДаты.Видимость = Ложь;
		Элементы.смартГруппаДополнительно.Видимость = Ложь;
		//++ #Б-2220 смарт: Фролов 28.02.2025 //План продаж и План-фактный анализ (доработка новых потребностей)
		Если НужноОткрытьФормуДляТиповНоменклатуры Тогда
			Элементы.смартРозничкаяЦенаДляПланирования.Видимость = Ложь;
		КонецЕсли;
		//-- #Б-2220 смарт: Фролов 28.02.2025
		
	//++ #Б-1704 смарт: Фролов 18.12.2024 //План продаж по сегментам. Дополнение. Доработать сегменты и документ План продаж	
	Иначе	
		
		Элементы.смартРозничкаяЦенаДляПланирования.Видимость = Ложь;
		
	//-- #Б-1704 смарт: Фролов 18.12.2024	
		
	КонецЕсли;
	//-- #Б-1436 смарт: Фролов 29.11.2024
	#КонецВставки
	
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПередЗаписьюНаСервере")
//++ #Б-1436 смарт: Фролов 29.11.2024 //План продаж по сегментам. Доработка справочников и документов.
Процедура смарт_ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	СегментыСервер.ПередЗаписьюНаСервере(ЭтаФорма,ТекущийОбъект);

	МодификацияКонфигурацииПереопределяемый.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
	#Вставка
	//++ #Б-1436 смарт: Фролов 29.11.2024 //План продаж по сегментам. Доработка справочников и документов.
	//++ #Б-2220 смарт: Фролов 28.02.2025 //План продаж и План-фактный анализ (доработка новых потребностей)
	//Если Объект.смартИспользуетсяВПланированииПродаж Тогда
	Если Объект.смартИспользуетсяВПланированииПродаж ИЛИ Объект.смартИспользуетсяКакТипНоменклатуры Тогда	
	//-- #Б-2220 смарт: Фролов 28.02.2025	
		
		СхемаСКД = Справочники.СегментыНоменклатуры.ПолучитьМакет("ОсновнаяСхема");
		
		Попытка 
			НастройкиСКД = ПолучитьИзВременногоХранилища(АдресНастроекСКД);
			МассивНоменклатуры = смартПолучитьМассивНоменклатурыСКД(СхемаСКД, НастройкиСКД);
			
			//++ #Б-2220 смарт: Фролов 28.02.2025 //План продаж и План-фактный анализ (доработка новых потребностей)
			Если Объект.смартИспользуетсяВПланированииПродаж Тогда
				Отказ = смартПроверитьПересечениеСДругимиСегментами(МассивНоменклатуры);
			КонецЕсли;
			//Отказ = смартПроверитьПересечениеСДругимиСегментами(МассивНоменклатуры);
			//-- #Б-2220 смарт: Фролов 28.02.2025
			
			//++ #Б-1704 смарт: Фролов 18.12.2024 //План продаж по сегментам. Дополнение. Доработать сегменты и документ План продаж
			Если ЗначениеЗаполнено(Объект.смартТоварСегмента) 
				И МассивНоменклатуры.Найти(Объект.смартТоварСегмента) = Неопределено Тогда
				
				ТекущийОбъект.смартТоварСегмента = Неопределено;
				ТекущийОбъект.смартВидЦены = Неопределено;
				ОбщегоНазначения.СообщитьПользователю("Цена сегмента для Плана-продаж была очищена. Выбранный товар больше не входит в сегмент!");
				
			КонецЕсли;	
			//-- #Б-1704 смарт: Фролов 18.12.2024
			
		Исключение
			
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю("Не заполнены условия формирования сегмента. Запись не возможна!");
			
		КонецПопытки;	
		
	КонецЕсли;
	//-- #Б-1436 смарт: Фролов 29.11.2024
	#КонецВставки

КонецПроцедуры //-- #Б-1436 смарт: Фролов 29.11.2024

&НаКлиенте
&ИзменениеИКонтроль("ПослеЗаписи")
//++ #Б-1436 смарт: Фролов 29.11.2024 //План продаж по сегментам. Доработка справочников и документов.
Процедура смарт_ПослеЗаписи(ПараметрыЗаписи)

	МодификацияКонфигурацииКлиентПереопределяемый.ПослеЗаписи(ЭтаФорма, ПараметрыЗаписи);

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	#Вставка
	//++ #Б-1436 смарт: Фролов 29.11.2024 //План продаж по сегментам. Доработка справочников и документов.
	//++ #Б-2220 смарт: Фролов 28.02.2025 //План продаж и План-фактный анализ (доработка новых потребностей)
	//Если Объект.смартИспользуетсяВПланированииПродаж Тогда
	Если Объект.смартИспользуетсяВПланированииПродаж ИЛИ Объект.смартИспользуетсяКакТипНоменклатуры Тогда	
	//-- #Б-2220 смарт: Фролов 28.02.2025	
		
		СегментыВызовСервера.Сформировать(Объект.Ссылка);
		ПоказатьОповещениеПользователя(
			НСтр("ru='Формирование сегмента номенклатуры'"),,
			НСтр("ru='Сегмент сформирован.'"));
		
	КонецЕсли;	
	//-- #Б-1436 смарт: Фролов 29.11.2024
	#КонецВставки

КонецПроцедуры //-- #Б-1436 смарт: Фролов 29.11.2024

&НаСервере
//++ #Б-1704 смарт: Фролов 18.12.2024 //План продаж по сегментам. Дополнение. Доработать сегменты и документ План продаж
Функция смартПолучитьНоменклатуруСегмента()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрСведений.НоменклатураСегмента
	|ГДЕ
	|	Сегмент = &Сегмент");
	Запрос.УстановитьПараметр("Сегмент", Объект.Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");
	
КонецФункции //-- #Б-1704 смарт: Фролов 18.12.2024	

&НаКлиенте
//++ #Б-1704 смарт: Фролов 18.12.2024 //План продаж по сегментам. Дополнение. Доработать сегменты и документ План продаж
Процедура смартРозничкаяЦенаДляПланированияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Объект.Ссылка.Пустая() Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Для выбора необходимо записать сегмент номенклатуры!");
		Возврат;
	КонецЕсли;	
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыОткрытия.Вставить("МассивНоменклатуры", смартПолучитьНоменклатуруСегмента());
	
	ОткрытьФорму("Справочник.Номенклатура.Форма.смартФормаВыбораДляПланирования", ПараметрыОткрытия, 
		ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры //-- #Б-1704 смарт: Фролов 18.12.2024
	

&НаКлиенте
Процедура смарт_ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыбраныНоменклатураИЦена" Тогда
		
		Объект.смартТоварСегмента = Параметр.Номенклатура;
		Объект.смартВидЦены = Параметр.ВидЦены;
		ЭтаФорма.Модифицированность = Истина;
		
	КонецЕсли;	
	
КонецПроцедуры
